app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    if (@movie.update(movie_params))
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["release_date", "1974-04-25 00:00:00"], ["updated_at", "2023-11-28 21:19:45.546663"], ["id", 1]]